SM_для_EDT/src/Catalogs/vftПроектыСудов/vftПроектыСудов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>vftПроектыСудов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СредняяСкоростьНаМореВГрузу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СредняяСкоростьНаМореВБалласте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МодельРДО</name>
    <type>
      <types>CatalogRef.впМодельРДО</types>
    </type>
  </attributes>
  <attributes>
    <name>СредняяСкоростьНаРекеВГрузу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СредняяСкоростьНаРекеВБалласте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипХода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Толкач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МощностьДвигателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ШаблонДляТопливныхОтчетов</name>
    <attributes>
      <name>ВидТоплива</name>
      <type>
        <types>CatalogRef.рарусСправочникСсылок</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/Catalogs/рарусСправочникСсылок/рарусСправочникСсылок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рарусСправочникСсылок</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>FSC</name>
      <description>FSC</description>
    </items>
    <items>
      <name>PSC</name>
      <description>PSC</description>
    </items>
    <items>
      <name>ГПК</name>
      <description>ГПК</description>
    </items>
    <items>
      <name>ДиректоруПоЭксплуатации</name>
      <description>Директор по эксплуатации в родительном падеже</description>
    </items>
    <items>
      <name>ИнтервалМеждуРейсами</name>
      <description>Интервал между рейсами, часы</description>
    </items>
    <items>
      <name>МаслоГД</name>
      <description>Масло ГД</description>
    </items>
    <items>
      <name>МаслоДГ</name>
      <description>Масло ДГ</description>
    </items>
    <items>
      <name>МинКоличествоСтрокАзов</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение Азов&quot;</description>
    </items>
    <items>
      <name>МинКоличествоСтрокКЕК</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение КЕК&quot;</description>
    </items>
    <items>
      <name>МинКоличествоСтрокЛоцман</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение участков с лоцманом&quot;</description>
    </items>
    <items>
      <name>МинКоличествоСтрокРостов</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение Ростов&quot;</description>
    </items>
    <items>
      <name>МодельРДО_ННФ</name>
      <description>Модель РДО (Нефтеналивной флот)</description>
    </items>
    <items>
      <name>МодельРДО_СГФ</name>
      <description>Модель РДО (Сухогрузный флот)</description>
    </items>
    <items>
      <name>МодельРДО_СЗП</name>
      <description>Модель РДО (Морской сухогрузный флот)</description>
    </items>
    <items>
      <name>РМРС</name>
      <description>РМРС</description>
    </items>
    <items>
      <name>ТопливоМТ01</name>
      <description>МТ 0.1</description>
    </items>
    <items>
      <name>ТопливоМТ05</name>
      <description>МТ 0.5</description>
    </items>
    <items>
      <name>ТопливоМТ15</name>
      <description>МТ 1.5</description>
    </items>
    <items>
      <name>ТопливоСМТ</name>
      <description>СМТ</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>CatalogRef.vftТиповыеОперации</types>
      <types>CatalogRef.Номенклатура</types>
      <types>String</types>
      <types>CatalogRef.vftПунктыСледования</types>
      <types>Number</types>
      <types>CatalogRef.рарусУчасткиСОЛП</types>
      <types>CatalogRef.впМодельРДО</types>
      <types>CatalogRef.рарусКонтролирующиеОрганы</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SM_для_EDT/src/Catalogs/vftПроектыСудов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавитьСписокВыбораШаблонаДляТопливныхОтчетов();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ДобавитьСписокВыбораШаблонаДляТопливныхОтчетов()
	СписокВыбора = Элементы.ШаблонДляТопливныхОтчетовВидТоплива.СписокВыбора;
	СписокВыбора.Добавить(Справочники.рарусСправочникСсылок.ТопливоСМТ, "СМТ");
	СписокВыбора.Добавить(Справочники.рарусСправочникСсылок.ТопливоМТ01, "МТ 0.1");
	СписокВыбора.Добавить(Справочники.рарусСправочникСсылок.ТопливоМТ05, "МТ 0.5");
	СписокВыбора.Добавить(Справочники.рарусСправочникСсылок.ТопливоМТ15, "МТ 1.5");
	СписокВыбора.Добавить(Справочники.рарусСправочникСсылок.МаслоГД, "Масло ГД");
	СписокВыбора.Добавить(Справочники.рарусСправочникСсылок.МаслоДГ, "Масло ДГ");
	СписокВыбора.Добавить("Масло", "Масло ГД+ДГ");
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда) Экспорт
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды() Экспорт
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
